stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_hal_flash.h
/** @defgroup FLASH_Flags FLASH Flags Definition
  * @{
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define FLASH_FLAG_EOP       FLASH_SECSR_EOP                   /*!< FLASH End of operation flag */
#define FLASH_FLAG_OPERR     FLASH_SECSR_OPERR                 /*!< FLASH Operation error flag */
#define FLASH_FLAG_PROGERR   FLASH_SECSR_PROGERR               /*!< FLASH Programming error flag */
#define FLASH_FLAG_WRPERR    FLASH_SECSR_WRPERR                /*!< FLASH Write protection error flag */
#define FLASH_FLAG_PGAERR    FLASH_SECSR_PGAERR                /*!< FLASH Programming alignment error flag */
#define FLASH_FLAG_SIZERR    FLASH_SECSR_SIZERR                /*!< FLASH Size error flag */
#define FLASH_FLAG_PGSERR    FLASH_SECSR_PGSERR                /*!< FLASH Programming sequence error flag */
#define FLASH_FLAG_OPTWERR   FLASH_NSSR_OPTWERR                /*!< FLASH Option modification error flag  */
#define FLASH_FLAG_BSY       FLASH_SECSR_BSY                   /*!< FLASH Busy flag */
#define FLASH_FLAG_WDW       FLASH_SECSR_WDW                   /*!< FLASH Wait Data to Write flag */
#define FLASH_FLAG_ECCC      FLASH_ECCR_ECCC                   /*!< FLASH ECC correction */
#define FLASH_FLAG_ECCD      FLASH_ECCR_ECCD                   /*!< FLASH ECC detection */

#define FLASH_FLAG_SR_ERRORS    (FLASH_FLAG_OPERR  | FLASH_FLAG_PROGERR | FLASH_FLAG_WRPERR | \
                                 FLASH_FLAG_PGAERR | FLASH_FLAG_SIZERR  | FLASH_FLAG_PGSERR)         /*!< Flash all flags from Status Register */
#define FLASH_FLAG_ECCR_ERRORS  (FLASH_FLAG_ECCD | FLASH_FLAG_ECCC)                                  /*!< Flash all flags from ECC Register */
#define FLASH_FLAG_ALL_ERRORS   (FLASH_FLAG_SR_ERRORS | FLASH_FLAG_OPTWERR | FLASH_FLAG_ECCR_ERRORS) /*!< Flash all flags */
#else
#define FLASH_FLAG_EOP       FLASH_NSSR_EOP                   /*!< FLASH End of operation flag */
#define FLASH_FLAG_OPERR     FLASH_NSSR_OPERR                 /*!< FLASH Operation error flag */
#define FLASH_FLAG_PROGERR   FLASH_NSSR_PROGERR               /*!< FLASH Programming error flag */
#define FLASH_FLAG_WRPERR    FLASH_NSSR_WRPERR                /*!< FLASH Write protection error flag */
#define FLASH_FLAG_PGAERR    FLASH_NSSR_PGAERR                /*!< FLASH Programming alignment error flag */
#define FLASH_FLAG_SIZERR    FLASH_NSSR_SIZERR                /*!< FLASH Size error flag  */
#define FLASH_FLAG_PGSERR    FLASH_NSSR_PGSERR                /*!< FLASH Programming sequence error flag */
#define FLASH_FLAG_OPTWERR   FLASH_NSSR_OPTWERR               /*!< FLASH Option modification error flag  */
#define FLASH_FLAG_BSY       FLASH_NSSR_BSY                   /*!< FLASH Busy flag */
#define FLASH_FLAG_WDW       FLASH_NSSR_WDW                   /*!< FLASH Wait Data to Write flag */
#define FLASH_FLAG_OEM1LOCK  FLASH_NSSR_OEM1LOCK              /*!< FLASH OEM1 key RDP lock flag */
#define FLASH_FLAG_OEM2LOCK  FLASH_NSSR_OEM2LOCK              /*!< FLASH OEM2 key RDP lock flag */
#define FLASH_FLAG_PD        FLASH_NSSR_PD                    /*!< FLASH in power-down lock flag */
#define FLASH_FLAG_ECCC      FLASH_ECCR_ECCC                  /*!< FLASH ECC correction */
#define FLASH_FLAG_ECCD      FLASH_ECCR_ECCD                  /*!< FLASH ECC detection */

#define FLASH_FLAG_SR_ERRORS    (FLASH_FLAG_OPERR  | FLASH_FLAG_PROGERR | FLASH_FLAG_WRPERR  | \
                                 FLASH_FLAG_PGAERR | FLASH_FLAG_SIZERR  | FLASH_FLAG_PGSERR  | \
                                 FLASH_FLAG_OPTWERR)                            /*!< Flash all flags from Status Register */
#define FLASH_FLAG_ECCR_ERRORS  (FLASH_FLAG_ECCD | FLASH_FLAG_ECCC)             /*!< Flash all flags from ECC Register */
#define FLASH_FLAG_ALL_ERRORS   (FLASH_FLAG_SR_ERRORS | FLASH_FLAG_ECCR_ERRORS) /*!< Flash all flags */
#endif /* __ARM_FEATURE_CMSE */
/**
  * @}
  */

/** @defgroup FLASH_Interrupt_definition FLASH Interrupts Definition
  * @brief FLASH Interrupt definition
  * @{
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define FLASH_IT_EOP     FLASH_SECCR1_EOPIE     /*!< End of FLASH Operation Interrupt source */
#define FLASH_IT_OPERR   FLASH_SECCR1_ERRIE     /*!< Error Interrupt source */
#define FLASH_IT_ECCC    (FLASH_ECCR_ECCIE >> FLASH_ECCR_ECCIE_Pos) /*!< ECC Correction Interrupt source */
#else
#define FLASH_IT_EOP     FLASH_NSCR1_EOPIE       /*!< End of FLASH Operation Interrupt source */
#define FLASH_IT_OPERR   FLASH_NSCR1_ERRIE       /*!< Error Interrupt source */
#define FLASH_IT_ECCC    (FLASH_ECCR_ECCIE >> FLASH_ECCR_ECCIE_Pos) /*!< ECC Correction Interrupt source */
#endif /* __ARM_FEATURE_CMSE */
/**
  * @}
  */

/** @defgroup FLASH_Error FLASH Error
  * @{
  */
#define HAL_FLASH_ERROR_NONE   0x00000000U        /*!< Flash no error */
#define HAL_FLASH_ERROR_OP     FLASH_FLAG_OPERR   /*!< Flash operation error */
#define HAL_FLASH_ERROR_PROG   FLASH_FLAG_PROGERR /*!< Flash programming error */
#define HAL_FLASH_ERROR_WRP    FLASH_FLAG_WRPERR  /*!< Flash write protection error */
#define HAL_FLASH_ERROR_PGA    FLASH_FLAG_PGAERR  /*!< Flash programming alignment error */
#define HAL_FLASH_ERROR_SIZ    FLASH_FLAG_SIZERR  /*!< Flash size error */
#define HAL_FLASH_ERROR_PGS    FLASH_FLAG_PGSERR  /*!< Flash programming sequence error */
#define HAL_FLASH_ERROR_OPTW   FLASH_FLAG_OPTWERR /*!< Flash option modification error */
#define HAL_FLASH_ERROR_ECCC   FLASH_FLAG_ECCC    /*!< Flash ECC correction error */
#define HAL_FLASH_ERROR_ECCD   FLASH_FLAG_ECCD    /*!< Flash ECC detection error */
/**
  * @}
  */

/** @defgroup FLASH_Type_Erase FLASH Erase Type
  * @{
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define FLASH_TYPEERASE_PAGES        FLASH_SECCR1_PER                                              /*!< Secure pages erase activation */
#define FLASH_TYPEERASE_PAGES_NS     (FLASH_NSCR1_PER  | FLASH_NON_SECURE_MASK)                    /*!< Non-secure pages erase activation */
#define FLASH_TYPEERASE_MASSERASE    FLASH_SECCR1_MER                                              /*!< Secure flash mass erase activation */
#define FLASH_TYPEERASE_MASSERASE_NS (FLASH_NSCR1_MER  | FLASH_NON_SECURE_MASK)                     /*!< Non-secure flash mass erase activation */
#else
#define FLASH_TYPEERASE_PAGES        FLASH_NSCR1_PER                                                /*!< Pages erase activation */
#define FLASH_TYPEERASE_MASSERASE    FLASH_NSCR1_MER                                                /*!< Flash mass erase activation */
#endif /* __ARM_FEATURE_CMSE */
/**
  * @}
  */

/** @defgroup FLASH_Banks FLASH Banks
  * @{
  */
#define FLASH_BANK_1      FLASH_NSCR1_MER                  /*!< Bank 1 */
#define FLASH_BANK_BOTH   FLASH_BANK_1                     /*!< Bank 1 */
/**
  * @}
  */

/** @defgroup FLASH_TYPE_PROGRAM FLASH Program Type
  * @{
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define FLASH_TYPEPROGRAM_QUADWORD    FLASH_SECCR1_PG                          /*!< Program a quad-word (128-bit) at a specified secure address */
#define FLASH_TYPEPROGRAM_QUADWORD_NS (FLASH_NSCR1_PG | FLASH_NON_SECURE_MASK) /*!< Program a quad-word (128-bit) at a specified non-secure address */
#define FLASH_TYPEPROGRAM_BURST       (FLASH_SECCR1_PG | FLASH_SECCR1_BWR)     /*!< Program a burst (8xquad-word) at a specified secure address */
#define FLASH_TYPEPROGRAM_BURST_NS    (FLASH_NSCR1_PG | FLASH_NSCR1_BWR | FLASH_NON_SECURE_MASK) /*!< Program a burst (8xquad-word) at a specified non-secure address */
#else
#define FLASH_TYPEPROGRAM_QUADWORD    FLASH_NSCR1_PG                           /*!<Program a quad-word (128-bit) at a specified address */
#define FLASH_TYPEPROGRAM_BURST       (FLASH_NSCR1_PG | FLASH_NSCR1_BWR)        /*!<Program a burst (8xquad-word) at a specified address */
#endif /* __ARM_FEATURE_CMSE */
/**
  * @}
  */

/** @defgroup FLASH_OB_Type FLASH Option Bytes Type
  * @{
  */
#define OPTIONBYTE_WRP        0x00000001U /*!< WRP option byte configuration */
#define OPTIONBYTE_RDP        0x00000002U /*!< RDP option byte configuration */
#define OPTIONBYTE_USER       0x00000004U /*!< USER option byte configuration */
#define OPTIONBYTE_BOOTADDR   0x00000008U /*!< Boot address option byte configuration */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define OPTIONBYTE_WMSEC      0x00000010U /*!< Watermark-based secure area option byte configuration */
#define OPTIONBYTE_BOOT_LOCK  0x00000020U /*!< Boot lock option byte configuration */
#endif /* __ARM_FEATURE_CMSE */
#define OPTIONBYTE_RDPKEY     0x00000040U /*!< RDP Key option byte configuration */
/**
  * @}
  */

/** @defgroup FLASH_OB_WRP_Area FLASH WRP Area
  * @{
  */
#define OB_WRPAREA_BANK1_AREAA   0x00000001U /*!< Flash Area A */
#define OB_WRPAREA_BANK1_AREAB   0x00000002U /*!< Flash Area B */
/**
  * @}
  */

/** @defgroup FLASH_OB_Read_Protection FLASH Option Bytes Read Protection
  * @{
  */
#define OB_RDP_LEVEL_0   0xAAU /*!< RDP level 0 code */
#define OB_RDP_LEVEL_0_5 0x55U /*!< RDP level 0.5 code */
#define OB_RDP_LEVEL_1   0xBBU /*!< RDP level 1 code */
#define OB_RDP_LEVEL_2   0xCCU /*!< RDP level 2 code.
                                    Warning: When enabling read protection level 2
                                    it's no more possible to go back to level 1 or 0. */
/**
  * @}
  */

/** @defgroup FLASH_OB_RDP_Key_Type FLASH Option Bytes Read Protection Key Type
  * @{
  */
#define OB_RDP_KEY_OEM1 0x01U  /*!< OEM1 key */
#define OB_RDP_KEY_OEM2 0x02U  /*!< OEM2 key */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_Type FLASH Option Bytes User Type
  * @{
  */
#define OB_USER_BOR_LEV      FLASH_OPTR_BOR_LEV     /*!< BOR reset Level */
#define OB_USER_nRST_STOP    FLASH_OPTR_nRST_STOP   /*!< Reset generated when entering the stop mode */
#define OB_USER_nRST_STDBY   FLASH_OPTR_nRST_STDBY  /*!< Reset generated when entering the standby mode */
#define OB_USER_SRAM1_RST    FLASH_OPTR_SRAM1_RST   /*!< SRAM1 erase upon system reset */
#define OB_USER_IWDG_SW      FLASH_OPTR_IWDG_SW     /*!< Independent watchdog selection */
#define OB_USER_IWDG_STOP    FLASH_OPTR_IWDG_STOP   /*!< Independent watchdog counter freeze in stop mode */
#define OB_USER_IWDG_STDBY   FLASH_OPTR_IWDG_STDBY  /*!< Independent watchdog counter freeze in standby mode */
#define OB_USER_WWDG_SW      FLASH_OPTR_WWDG_SW     /*!< Window watchdog selection */
#define OB_USER_SRAM2_PE     FLASH_OPTR_SRAM2_PE    /*!< SRAM2 parity error enable */
#define OB_USER_SRAM2_RST    FLASH_OPTR_SRAM2_RST   /*!< SRAM2 Erase when system reset */
#define OB_USER_nSWBOOT0     FLASH_OPTR_nSWBOOT0    /*!< Software BOOT0 */
#define OB_USER_nBOOT0       FLASH_OPTR_nBOOT0      /*!< nBOOT0 option bit */
#if defined(FLASH_OPTR_TZEN)
#define OB_USER_TZEN         FLASH_OPTR_TZEN        /*!< Global TrustZone enable */
#endif /* FLASH_OPTR_TZEN */

